app/Controllers/Home.php

    public function Vizualizar()
    {
        $categorias = $this->categoriaModel->orderBy('nome', 'ASC')->findAll();
        $produtosPorCategoria = [];
        $produtosParaSlider = [];

        foreach ($categorias as $categoria) {
            $produtos = $this->produtoModel
                ->select([
                    'produtos.id', 'produtos.nome', 'produtos.slug', 'produtos.descricao',
                    'produtos.ingredientes', 'produtos.ativo', 'produtos.imagem',
                    'MIN(produtos_especificacoes.preco) AS preco',
                ])
                ->join('produtos_especificacoes', 'produtos_especificacoes.produto_id = produtos.id')
                ->where('produtos.categoria_id', $categoria->id)
                ->where('produtos.ativo', true)
                ->groupBy('produtos.id, produtos.nome, produtos.slug, produtos.descricao, produtos.ingredientes, produtos.ativo, produtos.imagem')
                ->orderBy('produtos.nome', 'ASC')
                ->findAll();
---
SELECT `produtos`.`id`, `produtos`.`nome`, `produtos`.`slug`, `produtos`.`descricao`, `produtos`.`ingredientes`, `produtos`.`ativo`, `produtos`.`imagem`, MIN(produtos_especificacoes.preco) AS preco
FROM `produtos`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`produto_id` = `produtos`.`id`
WHERE `produtos`.`categoria_id` = '1'
AND `produtos`.`ativo` = 1
AND `produtos`.`deletado_em` IS NULL
GROUP BY `produtos`.`id`, `produtos`.`nome`, `produtos`.`slug`, `produtos`.`descricao`, `produtos`.`ingredientes`, `produtos`.`ativo`, `produtos`.`imagem`
ORDER BY `produtos`.`nome` ASC


        // --- INÍCIO DA ALTERAÇÃO ---

        // 1. Busca os dados da primeira empresa encontrada no banco de dados.
        $empresa = $this->empresaModel->first();
---
SELECT *
FROM `empresa`
 LIMIT 1